#include <stdio.h>

int main() {
    // 1. สร้างรถไฟ 4 โบกี้
    int prices[4] = {50, 20, 15, 5}; 
    int total = 0; // ตะกร้าใส่ทอง

    // 2. ส่งพนักงาน (p) ไปยืนโบกี้แรก
    int *p = prices; 

    // 3. วนลูป 4 รอบ (เดิน 4 โบกี้)
    for (int i = 0; i < 4; i++) {
        
        // ขั้น A: หยิบทอง (*p) มาใส่ตะกร้า (total)
        // รอบ 1: หยิบ 50 ... ตะกร้ามี 50
        // รอบ 2: หยิบ 20 ... ตะกร้ามี 70
        total = total + *p; 

        // ขั้น B: เดินหน้าไปโบกี้ถัดไป (สำคัญมาก!)
        p++; 
    }

    printf("Total Sum: %d\n", total); // ต้องได้ 90

    return 0;
}